shortk10/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
      //  type            fixedFluxPressure;
        type            codedMixed;

        refValue        uniform 0;
        refGradient     uniform 0;
        valueFraction   uniform 0;

        name    rampedMixed;   // name of generated BC

        code
        #{
            //- Permeability coefficient
            scalar K(1e10);
            
            const fvsPatchField<scalar>& phi=
                patch().lookupPatchField<surfaceScalarField, scalar>("phi");

            
            this->refGrad() = - K*phi;
         //   this->valueFraction() = 1.0;
        #};

    }

    inlet
    {
        type            fixedFluxPressure;
        value           uniform 100;
    }

    outlet
    {
        type            fixedValue;
        value              uniform 0;

    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
	
